In [1]:
import pandas as pd

## Comma Separated, No Header

In [16]:
csv_df = pd.read_csv("demo_csv/demo_comma_no_header.csv", header=None)

In [17]:
csv_df

          0   1   2      3
0    Norway   1   1   2.00
1   Denmark       2   2.00
2    Sweden   2   3   7.50
3   Finland   3   4  13.20
4   Germany   4   6  21.20
5     Italy   5   9  34.00
6  Scotland   6  10  42.42

In [18]:
csv_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       7 non-null      object
 1   1       7 non-null      object
 2   2       7 non-null      int64
 3   3       7 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 352.0+ bytes

### Missing Values in Numeric Column in the CSV

Note that the missing entry in the second role is read in as a space, rather than as a null

In [20]:
csv_df[1].iloc[1]

' '

As a result of this space, all of the other values in the column are also read as strings, rather than nulls

In [21]:
csv_df[1].iloc[0]

' 1'

Two approaches at this point

### 1.  Specifying that spaces are nan

In [22]:
csv_df_2 = pd.read_csv("demo_csv/demo_comma_no_header.csv", header=None, na_values=" ")

In [24]:
csv_df_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       7 non-null      object
 1   1       6 non-null      float64
 2   2       7 non-null      int64
 3   3       7 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 352.0+ bytes

So column 1 is now numeric, though float.  This is because nan is a float.  There are fixes to this (see https://pandas.pydata.org/docs/user_guide/integer_na.html) but I don't want to get into it here in the interest of keeping this as an introduction

### 2.  Use apply to map the space to nan, other strings to the numeric value

In [35]:
" ".strip()

''

In [37]:
csv_df_3 = csv_df.copy()
csv_df_3[1] = csv_df[1].apply(lambda x: None if x.strip() == "" else int(x.strip()))

In [39]:
csv_df_3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       7 non-null      object
 1   1       6 non-null      float64
 2   2       7 non-null      int64
 3   3       7 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 352.0+ bytes

### Specify Column Names

At read-in

In [44]:
csv_df_4 = pd.read_csv("demo_csv/demo_comma_no_header.csv", header=None, na_values=" ", 
                       names=["Country", "A", "B", "x"])

In [43]:
csv_df_3

          0    1   2      3
0    Norway  1.0   1   2.00
1   Denmark  NaN   2   2.00
2    Sweden  2.0   3   7.50
3   Finland  3.0   4  13.20
4   Germany  4.0   6  21.20
5     Italy  5.0   9  34.00
6  Scotland  6.0  10  42.42

Using rename.  Note that if axis=1 is not specified, rename will act on the row index rather than the column index.

In [58]:
csv_df_5 = csv_df_3.rename({0: "Country", 1: "A", 2: "B", 3: "x"}, axis=1)

In [59]:
csv_df_5

    Country    A   B      x
0    Norway  1.0   1   2.00
1   Denmark  NaN   2   2.00
2    Sweden  2.0   3   7.50
3   Finland  3.0   4  13.20
4   Germany  4.0   6  21.20
5     Italy  5.0   9  34.00
6  Scotland  6.0  10  42.42

## Comma Separated, Header

In [62]:
csv_df_6 = pd.read_csv("demo_csv/demo_comma_header.csv", na_values=" ")

In [63]:
csv_df_6

    Country    A   B      x
0    Norway  1.0   1   2.00
1   Denmark  NaN   2   2.00
2    Sweden  2.0   3   7.50
3   Finland  3.0   4  13.20
4   Germany  4.0   6  21.20
5     Italy  5.0   9  34.00
6  Scotland  6.0  10  42.42

## Space Separated, Header

In [69]:
csv_df_7 = pd.read_csv("demo_csv/demo_space_header.csv", sep=" ")

In [70]:
csv_df_7

    Country    A   B      x
0    Norway  1.0   1   2.00
1   Denmark  NaN   2   2.00
2    Sweden  2.0   3   7.50
3   Finland  3.0   4  13.20
4   Germany  4.0   6  21.20
5     Italy  5.0   9  34.00
6  Scotland  6.0  10  42.42

Note that to have the NAN in right place we need to have exactly 2 spaces between "Denmark" and "2".  This is why commas are more popular than spaces as a separation character